MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA704/mcu.h
#define RTCCON1L RTCCON1L
extern volatile uint16_t RTCCON1L __attribute__((__sfr__));
typedef struct tagRTCCON1LBITS {
  uint16_t TSAEN:1;
  uint16_t :3;
  uint16_t OUTSEL:3;
  uint16_t RTCOE:1;
  uint16_t PWCPOE:1;
  uint16_t PWCPOL:1;
  uint16_t PWCEN:1;
  uint16_t WRLOCK:1;
  uint16_t :3;
  uint16_t RTCEN:1;
} RTCCON1LBITS;
extern volatile RTCCON1LBITS RTCCON1Lbits __attribute__((__sfr__));

#define RTCCON1H RTCCON1H
extern volatile uint16_t RTCCON1H __attribute__((__sfr__));
typedef struct tagRTCCON1HBITS {
  uint16_t ALMRPT:8;
  uint16_t AMASK:4;
  uint16_t :2;
  uint16_t CHIME:1;
  uint16_t ALRMEN:1;
} RTCCON1HBITS;
extern volatile RTCCON1HBITS RTCCON1Hbits __attribute__((__sfr__));

#define RTCCON2L RTCCON2L
extern volatile uint16_t RTCCON2L __attribute__((__sfr__));
typedef struct tagRTCCON2LBITS {
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t PS:2;
  uint16_t PWCPS:2;
  uint16_t :3;
  uint16_t FDIV:5;
} RTCCON2LBITS;
extern volatile RTCCON2LBITS RTCCON2Lbits __attribute__((__sfr__));

#define RTCCON2H RTCCON2H
extern volatile uint16_t RTCCON2H __attribute__((__sfr__));
#define RTCCON3L RTCCON3L
extern volatile uint16_t RTCCON3L __attribute__((__sfr__));
typedef struct tagRTCCON3LBITS {
  uint16_t PWCSTAB:8;
  uint16_t PWCSAMP:8;
} RTCCON3LBITS;
extern volatile RTCCON3LBITS RTCCON3Lbits __attribute__((__sfr__));

#define RTCSTATL RTCSTATL
extern volatile uint16_t RTCSTATL __attribute__((__sfr__));
typedef struct tagRTCSTATLBITS {
  uint16_t HALFSEC:1;
  uint16_t ALMSYNC:1;
  uint16_t SYNC:1;
  uint16_t TSAEVT:1;
  uint16_t :1;
  uint16_t ALMEVT:1;
} RTCSTATLBITS;
extern volatile RTCSTATLBITS RTCSTATLbits __attribute__((__sfr__));

#define TIMEL TIMEL
extern volatile uint16_t TIMEL __attribute__((__sfr__));
typedef struct tagTIMELBITS {
  uint16_t :8;
  uint16_t SECONE:4;
  uint16_t SECTEN:3;
} TIMELBITS;
extern volatile TIMELBITS TIMELbits __attribute__((__sfr__));

#define TIMEH TIMEH
extern volatile uint16_t TIMEH __attribute__((__sfr__));
typedef struct tagTIMEHBITS {
  uint16_t MINONE:4;
  uint16_t MINTEN:3;
  uint16_t :1;
  uint16_t HRONE:4;
  uint16_t HRTEN:2;
} TIMEHBITS;
extern volatile TIMEHBITS TIMEHbits __attribute__((__sfr__));

#define DATEL DATEL
extern volatile uint16_t DATEL __attribute__((__sfr__));
typedef struct tagDATELBITS {
  uint16_t WDAY:3;
  uint16_t :5;
  uint16_t DAYONE:4;
  uint16_t DAYTEN:2;
} DATELBITS;
extern volatile DATELBITS DATELbits __attribute__((__sfr__));

#define DATEH DATEH
extern volatile uint16_t DATEH __attribute__((__sfr__));
typedef struct tagDATEHBITS {
  uint16_t MTHONE:4;
  uint16_t MTHTEN:1;
  uint16_t :3;
  uint16_t YRONE:4;
  uint16_t YRTEN:4;
} DATEHBITS;
extern volatile DATEHBITS DATEHbits __attribute__((__sfr__));

#define ALMTIMEL ALMTIMEL
extern volatile uint16_t ALMTIMEL __attribute__((__sfr__));
typedef struct tagALMTIMELBITS {
  uint16_t :8;
  uint16_t SECONE:4;
  uint16_t SECTEN:3;
} ALMTIMELBITS;
extern volatile ALMTIMELBITS ALMTIMELbits __attribute__((__sfr__));

#define ALMTIMEH ALMTIMEH
extern volatile uint16_t ALMTIMEH __attribute__((__sfr__));
typedef struct tagALMTIMEHBITS {
  uint16_t MINONE:4;
  uint16_t MINTEN:3;
  uint16_t :1;
  uint16_t HRONE:4;
  uint16_t HRTEN:2;
} ALMTIMEHBITS;
extern volatile ALMTIMEHBITS ALMTIMEHbits __attribute__((__sfr__));

#define ALMDATEL ALMDATEL
extern volatile uint16_t ALMDATEL __attribute__((__sfr__));
typedef struct tagALMDATELBITS {
  uint16_t WDAY:3;
  uint16_t :5;
  uint16_t DAYONE:4;
  uint16_t DAYTEN:2;
} ALMDATELBITS;
extern volatile ALMDATELBITS ALMDATELbits __attribute__((__sfr__));

#define ALMDATEH ALMDATEH
extern volatile uint16_t ALMDATEH __attribute__((__sfr__));
typedef struct tagALMDATEHBITS {
  uint16_t MTHONE:4;
  uint16_t MTHTEN:1;
  uint16_t :3;
  uint16_t YRONE:4;
  uint16_t YRTEN:4;
} ALMDATEHBITS;
extern volatile ALMDATEHBITS ALMDATEHbits __attribute__((__sfr__));

#define TSATIMEL TSATIMEL
extern volatile uint16_t TSATIMEL __attribute__((__sfr__));
typedef struct tagTSATIMELBITS {
  uint16_t :8;
  uint16_t SECONE:4;
  uint16_t SECTEN:3;
} TSATIMELBITS;
extern volatile TSATIMELBITS TSATIMELbits __attribute__((__sfr__));

#define TSATIMEH TSATIMEH
extern volatile uint16_t TSATIMEH __attribute__((__sfr__));
typedef struct tagTSATIMEHBITS {
  uint16_t MINONE:4;
  uint16_t MINTEN:3;
  uint16_t :1;
  uint16_t HRONE:4;
  uint16_t HRTEN:2;
} TSATIMEHBITS;
extern volatile TSATIMEHBITS TSATIMEHbits __attribute__((__sfr__));

#define TSADATEL TSADATEL
extern volatile uint16_t TSADATEL __attribute__((__sfr__));
typedef struct tagTSADATELBITS {
  uint16_t WDAY:3;
  uint16_t :5;
  uint16_t DAYONE:4;
  uint16_t DAYTEN:2;
} TSADATELBITS;
extern volatile TSADATELBITS TSADATELbits __attribute__((__sfr__));

#define TSADATEH TSADATEH
extern volatile uint16_t TSADATEH __attribute__((__sfr__));
typedef struct tagTSADATEHBITS {
  uint16_t MTHONE:4;
  uint16_t MTHTEN:1;
  uint16_t :3;
  uint16_t YRONE:4;
  uint16_t YRTEN:4;
} TSADATEHBITS;
extern volatile TSADATEHBITS TSADATEHbits __attribute__((__sfr__));

#define IC1CON1 IC1CON1
extern volatile uint16_t IC1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagIC1CON1BITS {
  union {
    struct {
      uint16_t ICM:3;
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICI:2;
      uint16_t :3;
      uint16_t ICTSEL:3;
      uint16_t ICSIDL:1;
    };
    struct {
      uint16_t ICM0:1;
      uint16_t ICM1:1;
      uint16_t ICM2:1;
      uint16_t :2;
      uint16_t ICI0:1;
      uint16_t ICI1:1;
      uint16_t :3;
      uint16_t ICTSEL0:1;
      uint16_t ICTSEL1:1;
      uint16_t ICTSEL2:1;
    };
  };
} IC1CON1BITS;
extern volatile IC1CON1BITS IC1CON1bits __attribute__((__sfr__));

#define IC1CON2 IC1CON2
extern volatile uint16_t IC1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagIC1CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t :1;
      uint16_t TRIGSTAT:1;
      uint16_t ICTRIG:1;
      uint16_t IC32:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
    };
  };
} IC1CON2BITS;
