MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA704/mcu.h
/* IPC13 */
#define _INT3IP IPC13bits.INT3IP
#define _INT4IP IPC13bits.INT4IP
#define _INT3IP0 IPC13bits.INT3IP0
#define _INT3IP1 IPC13bits.INT3IP1
#define _INT3IP2 IPC13bits.INT3IP2
#define _INT4IP0 IPC13bits.INT4IP0
#define _INT4IP1 IPC13bits.INT4IP1
#define _INT4IP2 IPC13bits.INT4IP2

/* IPC14 */
#define _SPI1RXIP IPC14bits.SPI1RXIP
#define _SPI2RXIP IPC14bits.SPI2RXIP
#define _SPI1RXIP0 IPC14bits.SPI1RXIP0
#define _SPI1RXIP1 IPC14bits.SPI1RXIP1
#define _SPI1RXIP2 IPC14bits.SPI1RXIP2
#define _SPI2RXIP0 IPC14bits.SPI2RXIP0
#define _SPI2RXIP1 IPC14bits.SPI2RXIP1
#define _SPI2RXIP2 IPC14bits.SPI2RXIP2

/* IPC15 */
#define _SPI3RXIP IPC15bits.SPI3RXIP
#define _DMA5IP IPC15bits.DMA5IP
#define _RTCIP IPC15bits.RTCIP
#define _CCP1IP IPC15bits.CCP1IP
#define _SPI3RXIP0 IPC15bits.SPI3RXIP0
#define _SPI3RXIP1 IPC15bits.SPI3RXIP1
#define _SPI3RXIP2 IPC15bits.SPI3RXIP2
#define _DMA5IP0 IPC15bits.DMA5IP0
#define _DMA5IP1 IPC15bits.DMA5IP1
#define _DMA5IP2 IPC15bits.DMA5IP2
#define _RTCIP0 IPC15bits.RTCIP0
#define _RTCIP1 IPC15bits.RTCIP1
#define _RTCIP2 IPC15bits.RTCIP2
#define _CCP1IP0 IPC15bits.CCP1IP0
#define _CCP1IP1 IPC15bits.CCP1IP1
#define _CCP1IP2 IPC15bits.CCP1IP2

/* IPC16 */
#define _CCP2IP IPC16bits.CCP2IP
#define _U1ERIP IPC16bits.U1ERIP
#define _U2ERIP IPC16bits.U2ERIP
#define _CRCIP IPC16bits.CRCIP
#define _CCP2IP0 IPC16bits.CCP2IP0
#define _CCP2IP1 IPC16bits.CCP2IP1
#define _CCP2IP2 IPC16bits.CCP2IP2
#define _U1ERIP0 IPC16bits.U1ERIP0
#define _U1ERIP1 IPC16bits.U1ERIP1
#define _U1ERIP2 IPC16bits.U1ERIP2
#define _U2ERIP0 IPC16bits.U2ERIP0
#define _U2ERIP1 IPC16bits.U2ERIP1
#define _U2ERIP2 IPC16bits.U2ERIP2
#define _CRCIP0 IPC16bits.CRCIP0
#define _CRCIP1 IPC16bits.CRCIP1
#define _CRCIP2 IPC16bits.CRCIP2

/* IPC17 */
#define _DMA6IP0 IPC17bits.DMA6IP0
#define _DMA6IP1 IPC17bits.DMA6IP1
#define _DMA6IP2 IPC17bits.DMA6IP2
#define _DMA7IP0 IPC17bits.DMA7IP0
#define _DMA7IP1 IPC17bits.DMA7IP1
#define _DMA7IP2 IPC17bits.DMA7IP2
#define _SI2C3IP0 IPC17bits.SI2C3IP0
#define _SI2C3IP1 IPC17bits.SI2C3IP1
#define _SI2C3IP2 IPC17bits.SI2C3IP2
#define _MI2C3IP0 IPC17bits.MI2C3IP0
#define _MI2C3IP1 IPC17bits.MI2C3IP1
#define _MI2C3IP2 IPC17bits.MI2C3IP2

/* IPC18 */
#define _LVDIP IPC18bits.LVDIP
#define _LVDIP0 IPC18bits.LVDIP0
#define _LVDIP1 IPC18bits.LVDIP1
#define _LVDIP2 IPC18bits.LVDIP2
#define _CCP7IP0 IPC18bits.CCP7IP0
#define _CCP7IP1 IPC18bits.CCP7IP1
#define _CCP7IP2 IPC18bits.CCP7IP2

/* IPC19 */
#define _CTMUIP IPC19bits.CTMUIP
#define _CTMUIP0 IPC19bits.CTMUIP0
#define _CTMUIP1 IPC19bits.CTMUIP1
#define _CTMUIP2 IPC19bits.CTMUIP2

/* IPC20 */
#define _U3ERIP0 IPC20bits.U3ERIP0
#define _U3ERIP1 IPC20bits.U3ERIP1
#define _U3ERIP2 IPC20bits.U3ERIP2
#define _U3RXIP0 IPC20bits.U3RXIP0
#define _U3RXIP1 IPC20bits.U3RXIP1
#define _U3RXIP2 IPC20bits.U3RXIP2
#define _U3TXIP0 IPC20bits.U3TXIP0
#define _U3TXIP1 IPC20bits.U3TXIP1
#define _U3TXIP2 IPC20bits.U3TXIP2

/* IPC21 */
#define _I2C1BCIP IPC21bits.I2C1BCIP
#define _I2C2BCIP IPC21bits.I2C2BCIP
#define _USB1IP0 IPC21bits.USB1IP0
#define _USB1IP1 IPC21bits.USB1IP1
#define _USB1IP2 IPC21bits.USB1IP2
#define _U4ERIP0 IPC21bits.U4ERIP0
#define _U4ERIP1 IPC21bits.U4ERIP1
#define _U4ERIP2 IPC21bits.U4ERIP2

/* IPC22 */
#define _SPI3IP IPC22bits.SPI3IP
#define _SPI3TXIP IPC22bits.SPI3TXIP
#define _U4RXIP0 IPC22bits.U4RXIP0
#define _U4RXIP1 IPC22bits.U4RXIP1
#define _U4RXIP2 IPC22bits.U4RXIP2
#define _U4TXIP0 IPC22bits.U4TXIP0
#define _U4TXIP1 IPC22bits.U4TXIP1
#define _U4TXIP2 IPC22bits.U4TXIP2
#define _SPI3IP0 IPC22bits.SPI3IP0
#define _SPI3IP1 IPC22bits.SPI3IP1
#define _SPI3IP2 IPC22bits.SPI3IP2
#define _SPI3TXIP0 IPC22bits.SPI3TXIP0
#define _SPI3TXIP1 IPC22bits.SPI3TXIP1
#define _SPI3TXIP2 IPC22bits.SPI3TXIP2

/* IPC23 */
#define _CCP3IP IPC23bits.CCP3IP
#define _CCP4IP IPC23bits.CCP4IP
#define _CCP3IP0 IPC23bits.CCP3IP0
#define _CCP3IP1 IPC23bits.CCP3IP1
#define _CCP3IP2 IPC23bits.CCP3IP2
#define _CCP4IP0 IPC23bits.CCP4IP0
#define _CCP4IP1 IPC23bits.CCP4IP1
#define _CCP4IP2 IPC23bits.CCP4IP2

/* IPC24 */
#define _CLC1IP IPC24bits.CLC1IP
#define _CLC2IP IPC24bits.CLC2IP
#define _CLC1IP0 IPC24bits.CLC1IP0
#define _CLC1IP1 IPC24bits.CLC1IP1
#define _CLC1IP2 IPC24bits.CLC1IP2
#define _CLC2IP0 IPC24bits.CLC2IP0
#define _CLC2IP1 IPC24bits.CLC2IP1
#define _CLC2IP2 IPC24bits.CLC2IP2
#define _CLC3IP0 IPC24bits.CLC3IP0
#define _CLC3IP1 IPC24bits.CLC3IP1
#define _CLC3IP2 IPC24bits.CLC3IP2
#define _CLC4IP0 IPC24bits.CLC4IP0
#define _CLC4IP1 IPC24bits.CLC4IP1
#define _CLC4IP2 IPC24bits.CLC4IP2

/* IPC25 */
#define _CCT1IP IPC25bits.CCT1IP
#define _CCT2IP IPC25bits.CCT2IP
#define _CCT1IP0 IPC25bits.CCT1IP0
#define _CCT1IP1 IPC25bits.CCT1IP1
#define _CCT1IP2 IPC25bits.CCT1IP2
#define _CCT2IP0 IPC25bits.CCT2IP0
#define _CCT2IP1 IPC25bits.CCT2IP1
#define _CCT2IP2 IPC25bits.CCT2IP2

/* IPC26 */
#define _FSTIP IPC26bits.FSTIP
#define _FSTIP0 IPC26bits.FSTIP0
#define _FSTIP1 IPC26bits.FSTIP1
#define _FSTIP2 IPC26bits.FSTIP2

/* IPC27 */
#define _ECCIP IPC27bits.ECCIP
#define _RTCCTSIP IPC27bits.RTCCTSIP
#define _I2C3BCIP0 IPC27bits.I2C3BCIP0
#define _I2C3BCIP1 IPC27bits.I2C3BCIP1
#define _I2C3BCIP2 IPC27bits.I2C3BCIP2
#define _RTCCTCIP0 IPC27bits.RTCCTCIP0
#define _RTCCTSIP1 IPC27bits.RTCCTSIP1
#define _RTCCTSIP2 IPC27bits.RTCCTSIP2
#define _U5RXIP0 IPC27bits.U5RXIP0
#define _U5RXIP1 IPC27bits.U5RXIP1
#define _U5RXIP2 IPC27bits.U5RXIP2

/* IPC28 */
#define _U5TXIP0 IPC28bits.U5TXIP0
#define _U5TXIP1 IPC28bits.U5TXIP1
#define _U5TXIP2 IPC28bits.U5TXIP2
#define _U5ERIP0 IPC28bits.U5ERIP0
#define _U5ERIP1 IPC28bits.U5ERIP1
#define _U5ERIP2 IPC28bits.U5ERIP2
#define _U6RXIP0 IPC28bits.U6RXIP0
#define _U6RXIP1 IPC28bits.U6RXIP1
#define _U6RXIP2 IPC28bits.U6RXIP2
#define _U6TXIP0 IPC28bits.U6TXIP0
#define _U6TXIP1 IPC28bits.U6TXIP1
#define _U6TXIP2 IPC28bits.U6TXIP2

/* IPC29 */
#define _JTAGIP IPC29bits.JTAGIP
#define _U6ERIP0 IPC29bits.U6ERIP0
#define _U6ERIP1 IPC29bits.U6ERIP1
#define _U6ERIP2 IPC29bits.U6ERIP2
#define _JTAGIP0 IPC29bits.JTAGIP0
#define _JTAGIP1 IPC29bits.JTAGIP1
#define _JTAGIP2 IPC29bits.JTAGIP2

/* INTTREG */
#define _VECNUM INTTREGbits.VECNUM
#define _ILR INTTREGbits.ILR
#define _VHOLD INTTREGbits.VHOLD
#define _CPUIRQ INTTREGbits.CPUIRQ
#define _VECNUM0 INTTREGbits.VECNUM0
#define _VECNUM1 INTTREGbits.VECNUM1
#define _VECNUM2 INTTREGbits.VECNUM2
#define _VECNUM3 INTTREGbits.VECNUM3
#define _VECNUM4 INTTREGbits.VECNUM4
#define _VECNUM5 INTTREGbits.VECNUM5
#define _VECNUM6 INTTREGbits.VECNUM6
#define _VECNUM7 INTTREGbits.VECNUM7
#define _ILR0 INTTREGbits.ILR0
#define _ILR1 INTTREGbits.ILR1
#define _ILR2 INTTREGbits.ILR2
#define _ILR3 INTTREGbits.ILR3

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _SOSCEN OSCCONbits.SOSCEN
#define _POSCEN OSCCONbits.POSCEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLEN CLKDIVbits.PLLEN
#define _CPDIV CLKDIVbits.CPDIV
#define _RCDIV CLKDIVbits.RCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _CPDIV0 CLKDIVbits.CPDIV0
#define _CPDIV1 CLKDIVbits.CPDIV1
#define _RCDIV0 CLKDIVbits.RCDIV0
#define _RCDIV1 CLKDIVbits.RCDIV1
#define _RCDIV2 CLKDIVbits.RCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _STORPOL OSCTUNbits.STORPOL
#define _STOR OSCTUNbits.STOR
#define _STLPOL OSCTUNbits.STLPOL
#define _STLOCK OSCTUNbits.STLOCK
#define _STSRC OSCTUNbits.STSRC
#define _STSIDL OSCTUNbits.STSIDL
#define _STEN OSCTUNbits.STEN
/* Bitname _TUN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN5 cannot be defined because it is used by more than one SFR */

/* DCOTUN */
#define _DCOTUN DCOTUNbits.DCOTUN
/* Bitname _TUN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN5 cannot be defined because it is used by more than one SFR */

/* DCOCON */
#define _DCOFSEL DCOCONbits.DCOFSEL
#define _DCOEN DCOCONbits.DCOEN
#define _DCOFSEL0 DCOCONbits.DCOFSEL0
#define _DCOFSEL1 DCOCONbits.DCOFSEL1
#define _DCOFSEL2 DCOCONbits.DCOFSEL2
#define _DCOFSEL3 DCOCONbits.DCOFSEL3

/* OSCDIV */
#define _DIV OSCDIVbits.DIV
#define _DIV0 OSCDIVbits.DIV0
#define _DIV1 OSCDIVbits.DIV1
#define _DIV2 OSCDIVbits.DIV2
#define _DIV3 OSCDIVbits.DIV3
#define _DIV4 OSCDIVbits.DIV4
#define _DIV5 OSCDIVbits.DIV5
#define _DIV6 OSCDIVbits.DIV6
#define _DIV7 OSCDIVbits.DIV7
#define _DIV8 OSCDIVbits.DIV8
#define _DIV9 OSCDIVbits.DIV9
#define _DIV10 OSCDIVbits.DIV10
#define _DIV11 OSCDIVbits.DIV11
#define _DIV12 OSCDIVbits.DIV12
#define _DIV13 OSCDIVbits.DIV13
#define _DIV14 OSCDIVbits.DIV14

/* OSCFDIV */
#define _TRIM OSCFDIVbits.TRIM
#define _TRIM8 OSCFDIVbits.TRIM8
#define _TRIM7 OSCFDIVbits.TRIM7
#define _TRIM6 OSCFDIVbits.TRIM6
#define _TRIM5 OSCFDIVbits.TRIM5
#define _TRIM4 OSCFDIVbits.TRIM4
#define _TRIM3 OSCFDIVbits.TRIM3
#define _TRIM2 OSCFDIVbits.TRIM2
#define _TRIM1 OSCFDIVbits.TRIM1
#define _TRIM0 OSCFDIVbits.TRIM0

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
/* Bitname _CM cannot be defined because it is used by more than one SFR */
#define _RETEN RCONbits.RETEN
#define _SBOREN RCONbits.SBOREN
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR
#define _PMSLP RCONbits.PMSLP

/* HLVDCON */
#define _HLVDL HLVDCONbits.HLVDL
#define _LVDEVT HLVDCONbits.LVDEVT
#define _IRVST HLVDCONbits.IRVST
#define _BGVST HLVDCONbits.BGVST
#define _VDIR HLVDCONbits.VDIR
#define _LSIDL HLVDCONbits.LSIDL
#define _HLVDEN HLVDCONbits.HLVDEN
#define _HLVDL0 HLVDCONbits.HLVDL0
#define _HLVDL1 HLVDCONbits.HLVDL1
#define _HLVDL2 HLVDCONbits.HLVDL2
#define _HLVDL3 HLVDCONbits.HLVDL3

/* PMCON1 */
#define _IRQM PMCON1bits.IRQM
#define _BUSKEEP PMCON1bits.BUSKEEP
#define _ALMODE PMCON1bits.ALMODE
#define _ALP PMCON1bits.ALP
#define _CSF PMCON1bits.CSF
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
#define _ADRMUX PMCON1bits.ADRMUX
#define _PSIDL PMCON1bits.PSIDL
#define _PMPEN PMCON1bits.PMPEN
#define _IRQM0 PMCON1bits.IRQM0
#define _IRQM1 PMCON1bits.IRQM1
#define _CSF0 PMCON1bits.CSF0
#define _CSF1 PMCON1bits.CSF1
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
#define _ADRMUX0 PMCON1bits.ADRMUX0
#define _ADRMUX1 PMCON1bits.ADRMUX1

/* PMCON2 */
#define _RADDR PMCON2bits.RADDR
#define _TIMEOUT PMCON2bits.TIMEOUT
#define _ERROR PMCON2bits.ERROR
#define _BUSY PMCON2bits.BUSY
#define _RADDR16 PMCON2bits.RADDR16
#define _RADDR17 PMCON2bits.RADDR17
#define _RADDR18 PMCON2bits.RADDR18
#define _RADDR19 PMCON2bits.RADDR19
#define _RADDR20 PMCON2bits.RADDR20
#define _RADDR21 PMCON2bits.RADDR21
#define _RADDR22 PMCON2bits.RADDR22
#define _RADDR23 PMCON2bits.RADDR23

