MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA704/mcu.h
/* IOCSTAT */
#define _IOCPAF IOCSTATbits.IOCPAF
#define _IOCPBF IOCSTATbits.IOCPBF
#define _IOCPCF IOCSTATbits.IOCPCF

/* TRISA */
#define _TRISA0 TRISAbits.TRISA0
#define _TRISA1 TRISAbits.TRISA1
#define _TRISA2 TRISAbits.TRISA2
#define _TRISA3 TRISAbits.TRISA3
#define _TRISA4 TRISAbits.TRISA4
#define _TRISA7 TRISAbits.TRISA7
#define _TRISA8 TRISAbits.TRISA8
#define _TRISA9 TRISAbits.TRISA9
#define _TRISA10 TRISAbits.TRISA10

/* PORTA */
#define _RA0 PORTAbits.RA0
#define _RA1 PORTAbits.RA1
#define _RA2 PORTAbits.RA2
#define _RA3 PORTAbits.RA3
#define _RA4 PORTAbits.RA4
#define _RA7 PORTAbits.RA7
#define _RA8 PORTAbits.RA8
#define _RA9 PORTAbits.RA9
#define _RA10 PORTAbits.RA10

/* LATA */
#define _LATA0 LATAbits.LATA0
#define _LATA1 LATAbits.LATA1
#define _LATA2 LATAbits.LATA2
#define _LATA3 LATAbits.LATA3
#define _LATA4 LATAbits.LATA4
#define _LATA7 LATAbits.LATA7
#define _LATA8 LATAbits.LATA8
#define _LATA9 LATAbits.LATA9
#define _LATA10 LATAbits.LATA10

/* ODCA */
#define _ODCA0 ODCAbits.ODCA0
#define _ODCA1 ODCAbits.ODCA1
#define _ODCA2 ODCAbits.ODCA2
#define _ODCA3 ODCAbits.ODCA3
#define _ODCA4 ODCAbits.ODCA4
#define _ODCA7 ODCAbits.ODCA7
#define _ODCA8 ODCAbits.ODCA8
#define _ODCA9 ODCAbits.ODCA9
#define _ODCA10 ODCAbits.ODCA10

/* ANSA */
#define _ANSA0 ANSAbits.ANSA0
#define _ANSA1 ANSAbits.ANSA1
#define _ANSA2 ANSAbits.ANSA2
#define _ANSA3 ANSAbits.ANSA3
#define _ANSELA0 ANSAbits.ANSELA0
#define _ANSELA1 ANSAbits.ANSELA1
#define _ANSELA2 ANSAbits.ANSELA2
#define _ANSELA3 ANSAbits.ANSELA3

/* IOCPA */
/* Bitname _IOCPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA10 cannot be defined because it is used by more than one SFR */

/* IOCNA */
#define _IOCNA0 IOCNAbits.IOCNA0
#define _IOCNA1 IOCNAbits.IOCNA1
#define _IOCNA2 IOCNAbits.IOCNA2
#define _IOCNA3 IOCNAbits.IOCNA3
#define _IOCNA4 IOCNAbits.IOCNA4
#define _IOCNA7 IOCNAbits.IOCNA7
#define _IOCNA8 IOCNAbits.IOCNA8
#define _IOCNA9 IOCNAbits.IOCNA9
#define _IOCNA10 IOCNAbits.IOCNA10

/* IOCFA */
#define _IOCFA0 IOCFAbits.IOCFA0
#define _IOCFA1 IOCFAbits.IOCFA1
#define _IOCFA2 IOCFAbits.IOCFA2
#define _IOCFA3 IOCFAbits.IOCFA3
#define _IOCFA4 IOCFAbits.IOCFA4
#define _IOCFA7 IOCFAbits.IOCFA7
#define _IOCFA8 IOCFAbits.IOCFA8
#define _IOCFA9 IOCFAbits.IOCFA9
#define _IOCFA10 IOCFAbits.IOCFA10

/* CNPUA */
/* Bitname _IOCPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA10 cannot be defined because it is used by more than one SFR */
#define _IOCPUA0 CNPUAbits.IOCPUA0
#define _IOCPUA1 CNPUAbits.IOCPUA1
#define _IOCPUA2 CNPUAbits.IOCPUA2
#define _IOCPUA3 CNPUAbits.IOCPUA3
#define _IOCPUA4 CNPUAbits.IOCPUA4
#define _IOCPUA7 CNPUAbits.IOCPUA7
#define _IOCPUA8 CNPUAbits.IOCPUA8
#define _IOCPUA9 CNPUAbits.IOCPUA9
#define _IOCPUA10 CNPUAbits.IOCPUA10
#define _CNPUA0 CNPUAbits.CNPUA0
#define _CNPUA1 CNPUAbits.CNPUA1
#define _CNPUA2 CNPUAbits.CNPUA2
#define _CNPUA3 CNPUAbits.CNPUA3
#define _CNPUA4 CNPUAbits.CNPUA4
#define _CNPUA7 CNPUAbits.CNPUA7
#define _CNPUA8 CNPUAbits.CNPUA8
#define _CNPUA9 CNPUAbits.CNPUA9
#define _CNPUA10 CNPUAbits.CNPUA10

/* CNPDA */
#define _IOCPDA0 CNPDAbits.IOCPDA0
#define _IOCPDA1 CNPDAbits.IOCPDA1
#define _IOCPDA2 CNPDAbits.IOCPDA2
#define _IOCPDA3 CNPDAbits.IOCPDA3
#define _IOCPDA4 CNPDAbits.IOCPDA4
#define _IOCPDA7 CNPDAbits.IOCPDA7
#define _IOCPDA8 CNPDAbits.IOCPDA8
#define _IOCPDA9 CNPDAbits.IOCPDA9
#define _IOCPDA10 CNPDAbits.IOCPDA10
#define _CNPDA0 CNPDAbits.CNPDA0
#define _CNPDA1 CNPDAbits.CNPDA1
#define _CNPDA2 CNPDAbits.CNPDA2
#define _CNPDA3 CNPDAbits.CNPDA3
#define _CNPDA4 CNPDAbits.CNPDA4
#define _CNPDA7 CNPDAbits.CNPDA7
#define _CNPDA8 CNPDAbits.CNPDA8
#define _CNPDA9 CNPDAbits.CNPDA9
#define _CNPDA10 CNPDAbits.CNPDA10

/* TRISB */
#define _TRISB0 TRISBbits.TRISB0
#define _TRISB1 TRISBbits.TRISB1
#define _TRISB2 TRISBbits.TRISB2
#define _TRISB3 TRISBbits.TRISB3
#define _TRISB4 TRISBbits.TRISB4
#define _TRISB5 TRISBbits.TRISB5
#define _TRISB6 TRISBbits.TRISB6
#define _TRISB7 TRISBbits.TRISB7
#define _TRISB8 TRISBbits.TRISB8
#define _TRISB9 TRISBbits.TRISB9
#define _TRISB10 TRISBbits.TRISB10
#define _TRISB11 TRISBbits.TRISB11
#define _TRISB12 TRISBbits.TRISB12
#define _TRISB13 TRISBbits.TRISB13
#define _TRISB14 TRISBbits.TRISB14
#define _TRISB15 TRISBbits.TRISB15

/* PORTB */
#define _RB0 PORTBbits.RB0
#define _RB1 PORTBbits.RB1
#define _RB2 PORTBbits.RB2
#define _RB3 PORTBbits.RB3
#define _RB4 PORTBbits.RB4
#define _RB5 PORTBbits.RB5
#define _RB6 PORTBbits.RB6
#define _RB7 PORTBbits.RB7
#define _RB8 PORTBbits.RB8
#define _RB9 PORTBbits.RB9
#define _RB10 PORTBbits.RB10
#define _RB11 PORTBbits.RB11
#define _RB12 PORTBbits.RB12
#define _RB13 PORTBbits.RB13
#define _RB14 PORTBbits.RB14
#define _RB15 PORTBbits.RB15

/* LATB */
#define _LATB0 LATBbits.LATB0
#define _LATB1 LATBbits.LATB1
#define _LATB2 LATBbits.LATB2
#define _LATB3 LATBbits.LATB3
#define _LATB4 LATBbits.LATB4
#define _LATB5 LATBbits.LATB5
#define _LATB6 LATBbits.LATB6
#define _LATB7 LATBbits.LATB7
#define _LATB8 LATBbits.LATB8
#define _LATB9 LATBbits.LATB9
#define _LATB10 LATBbits.LATB10
#define _LATB11 LATBbits.LATB11
#define _LATB12 LATBbits.LATB12
#define _LATB13 LATBbits.LATB13
#define _LATB14 LATBbits.LATB14
#define _LATB15 LATBbits.LATB15

