MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA704/mcu.h
#define _REFOCONH_RODIV8_POSITION                0x00000008
#define _REFOCONH_RODIV8_MASK                    0x00000100
#define _REFOCONH_RODIV8_LENGTH                  0x00000001

#define _REFOCONH_RODIV9_POSITION                0x00000009
#define _REFOCONH_RODIV9_MASK                    0x00000200
#define _REFOCONH_RODIV9_LENGTH                  0x00000001

#define _REFOCONH_RODIV10_POSITION               0x0000000A
#define _REFOCONH_RODIV10_MASK                   0x00000400
#define _REFOCONH_RODIV10_LENGTH                 0x00000001

#define _REFOCONH_RODIV11_POSITION               0x0000000B
#define _REFOCONH_RODIV11_MASK                   0x00000800
#define _REFOCONH_RODIV11_LENGTH                 0x00000001

#define _REFOCONH_RODIV12_POSITION               0x0000000C
#define _REFOCONH_RODIV12_MASK                   0x00001000
#define _REFOCONH_RODIV12_LENGTH                 0x00000001

#define _REFOCONH_RODIV13_POSITION               0x0000000D
#define _REFOCONH_RODIV13_MASK                   0x00002000
#define _REFOCONH_RODIV13_LENGTH                 0x00000001

#define _REFOCONH_RODIV14_POSITION               0x0000000E
#define _REFOCONH_RODIV14_MASK                   0x00004000
#define _REFOCONH_RODIV14_LENGTH                 0x00000001

#define _PMD1_AD1MD_POSITION                     0x00000000
#define _PMD1_AD1MD_MASK                         0x00000001
#define _PMD1_AD1MD_LENGTH                       0x00000001

#define _PMD1_SPI1MD_POSITION                    0x00000003
#define _PMD1_SPI1MD_MASK                        0x00000008
#define _PMD1_SPI1MD_LENGTH                      0x00000001

#define _PMD1_SPI2MD_POSITION                    0x00000004
#define _PMD1_SPI2MD_MASK                        0x00000010
#define _PMD1_SPI2MD_LENGTH                      0x00000001

#define _PMD1_U1MD_POSITION                      0x00000005
#define _PMD1_U1MD_MASK                          0x00000020
#define _PMD1_U1MD_LENGTH                        0x00000001

#define _PMD1_U2MD_POSITION                      0x00000006
#define _PMD1_U2MD_MASK                          0x00000040
#define _PMD1_U2MD_LENGTH                        0x00000001

#define _PMD1_I2C1MD_POSITION                    0x00000007
#define _PMD1_I2C1MD_MASK                        0x00000080
#define _PMD1_I2C1MD_LENGTH                      0x00000001

#define _PMD1_T1MD_POSITION                      0x0000000B
#define _PMD1_T1MD_MASK                          0x00000800
#define _PMD1_T1MD_LENGTH                        0x00000001

#define _PMD1_T2MD_POSITION                      0x0000000C
#define _PMD1_T2MD_MASK                          0x00001000
#define _PMD1_T2MD_LENGTH                        0x00000001

#define _PMD1_T3MD_POSITION                      0x0000000D
#define _PMD1_T3MD_MASK                          0x00002000
#define _PMD1_T3MD_LENGTH                        0x00000001

#define _PMD2_OC1MD_POSITION                     0x00000000
#define _PMD2_OC1MD_MASK                         0x00000001
#define _PMD2_OC1MD_LENGTH                       0x00000001

#define _PMD2_OC2MD_POSITION                     0x00000001
#define _PMD2_OC2MD_MASK                         0x00000002
#define _PMD2_OC2MD_LENGTH                       0x00000001

#define _PMD2_OC3MD_POSITION                     0x00000002
#define _PMD2_OC3MD_MASK                         0x00000004
#define _PMD2_OC3MD_LENGTH                       0x00000001

#define _PMD2_IC1MD_POSITION                     0x00000008
#define _PMD2_IC1MD_MASK                         0x00000100
#define _PMD2_IC1MD_LENGTH                       0x00000001

#define _PMD2_IC2MD_POSITION                     0x00000009
#define _PMD2_IC2MD_MASK                         0x00000200
#define _PMD2_IC2MD_LENGTH                       0x00000001

#define _PMD2_IC3MD_POSITION                     0x0000000A
#define _PMD2_IC3MD_MASK                         0x00000400
#define _PMD2_IC3MD_LENGTH                       0x00000001

#define _PMD3_I2C2MD_POSITION                    0x00000001
#define _PMD3_I2C2MD_MASK                        0x00000002
#define _PMD3_I2C2MD_LENGTH                      0x00000001

#define _PMD3_CRCMD_POSITION                     0x00000007
#define _PMD3_CRCMD_MASK                         0x00000080
#define _PMD3_CRCMD_LENGTH                       0x00000001

#define _PMD3_PMPMD_POSITION                     0x00000008
#define _PMD3_PMPMD_MASK                         0x00000100
#define _PMD3_PMPMD_LENGTH                       0x00000001

#define _PMD3_RTCCMD_POSITION                    0x00000009
#define _PMD3_RTCCMD_MASK                        0x00000200
#define _PMD3_RTCCMD_LENGTH                      0x00000001

#define _PMD3_CMPMD_POSITION                     0x0000000A
#define _PMD3_CMPMD_MASK                         0x00000400
#define _PMD3_CMPMD_LENGTH                       0x00000001

#define _PMD4_LVDMD_POSITION                     0x00000001
#define _PMD4_LVDMD_MASK                         0x00000002
#define _PMD4_LVDMD_LENGTH                       0x00000001

#define _PMD4_CTMUMD_POSITION                    0x00000002
#define _PMD4_CTMUMD_MASK                        0x00000004
#define _PMD4_CTMUMD_LENGTH                      0x00000001

#define _PMD4_REFOMD_POSITION                    0x00000003
#define _PMD4_REFOMD_MASK                        0x00000008
#define _PMD4_REFOMD_LENGTH                      0x00000001

#define _PMD5_CCP1MD_POSITION                    0x00000000
#define _PMD5_CCP1MD_MASK                        0x00000001
#define _PMD5_CCP1MD_LENGTH                      0x00000001

#define _PMD5_CCP2MD_POSITION                    0x00000001
#define _PMD5_CCP2MD_MASK                        0x00000002
#define _PMD5_CCP2MD_LENGTH                      0x00000001

#define _PMD5_CCP3MD_POSITION                    0x00000002
#define _PMD5_CCP3MD_MASK                        0x00000004
#define _PMD5_CCP3MD_LENGTH                      0x00000001

#define _PMD5_CCP4MD_POSITION                    0x00000003
#define _PMD5_CCP4MD_MASK                        0x00000008
#define _PMD5_CCP4MD_LENGTH                      0x00000001

#define _PMD5_CCP5MD_POSITION                    0x00000004
#define _PMD5_CCP5MD_MASK                        0x00000010
#define _PMD5_CCP5MD_LENGTH                      0x00000001

#define _PMD6_SPI3MD_POSITION                    0x00000000
#define _PMD6_SPI3MD_MASK                        0x00000001
#define _PMD6_SPI3MD_LENGTH                      0x00000001

#define _PMD7_DMA0MD_POSITION                    0x00000004
#define _PMD7_DMA0MD_MASK                        0x00000010
#define _PMD7_DMA0MD_LENGTH                      0x00000001

#define _PMD7_DMA1MD_POSITION                    0x00000005
#define _PMD7_DMA1MD_MASK                        0x00000020
#define _PMD7_DMA1MD_LENGTH                      0x00000001

#define _PMD8_CLC1MD_POSITION                    0x00000002
#define _PMD8_CLC1MD_MASK                        0x00000004
#define _PMD8_CLC1MD_LENGTH                      0x00000001

#define _PMD8_CLC2MD_POSITION                    0x00000003
#define _PMD8_CLC2MD_MASK                        0x00000008
#define _PMD8_CLC2MD_LENGTH                      0x00000001

