MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA704/mcu.h
#define _IOCFB_IOCFB0_POSITION                   0x00000000
#define _IOCFB_IOCFB0_MASK                       0x00000001
#define _IOCFB_IOCFB0_LENGTH                     0x00000001

#define _IOCFB_IOCFB1_POSITION                   0x00000001
#define _IOCFB_IOCFB1_MASK                       0x00000002
#define _IOCFB_IOCFB1_LENGTH                     0x00000001

#define _IOCFB_IOCFB2_POSITION                   0x00000002
#define _IOCFB_IOCFB2_MASK                       0x00000004
#define _IOCFB_IOCFB2_LENGTH                     0x00000001

#define _IOCFB_IOCFB3_POSITION                   0x00000003
#define _IOCFB_IOCFB3_MASK                       0x00000008
#define _IOCFB_IOCFB3_LENGTH                     0x00000001

#define _IOCFB_IOCFB4_POSITION                   0x00000004
#define _IOCFB_IOCFB4_MASK                       0x00000010
#define _IOCFB_IOCFB4_LENGTH                     0x00000001

#define _IOCFB_IOCFB5_POSITION                   0x00000005
#define _IOCFB_IOCFB5_MASK                       0x00000020
#define _IOCFB_IOCFB5_LENGTH                     0x00000001

#define _IOCFB_IOCFB6_POSITION                   0x00000006
#define _IOCFB_IOCFB6_MASK                       0x00000040
#define _IOCFB_IOCFB6_LENGTH                     0x00000001

#define _IOCFB_IOCFB7_POSITION                   0x00000007
#define _IOCFB_IOCFB7_MASK                       0x00000080
#define _IOCFB_IOCFB7_LENGTH                     0x00000001

#define _IOCFB_IOCFB8_POSITION                   0x00000008
#define _IOCFB_IOCFB8_MASK                       0x00000100
#define _IOCFB_IOCFB8_LENGTH                     0x00000001

#define _IOCFB_IOCFB9_POSITION                   0x00000009
#define _IOCFB_IOCFB9_MASK                       0x00000200
#define _IOCFB_IOCFB9_LENGTH                     0x00000001

#define _IOCFB_IOCFB10_POSITION                  0x0000000A
#define _IOCFB_IOCFB10_MASK                      0x00000400
#define _IOCFB_IOCFB10_LENGTH                    0x00000001

#define _IOCFB_IOCFB11_POSITION                  0x0000000B
#define _IOCFB_IOCFB11_MASK                      0x00000800
#define _IOCFB_IOCFB11_LENGTH                    0x00000001

#define _IOCFB_IOCFB12_POSITION                  0x0000000C
#define _IOCFB_IOCFB12_MASK                      0x00001000
#define _IOCFB_IOCFB12_LENGTH                    0x00000001

#define _IOCFB_IOCFB13_POSITION                  0x0000000D
#define _IOCFB_IOCFB13_MASK                      0x00002000
#define _IOCFB_IOCFB13_LENGTH                    0x00000001

#define _IOCFB_IOCFB14_POSITION                  0x0000000E
#define _IOCFB_IOCFB14_MASK                      0x00004000
#define _IOCFB_IOCFB14_LENGTH                    0x00000001

#define _IOCFB_IOCFB15_POSITION                  0x0000000F
#define _IOCFB_IOCFB15_MASK                      0x00008000
#define _IOCFB_IOCFB15_LENGTH                    0x00000001

#define _CNPUB_IOCPB0_POSITION                   0x00000000
#define _CNPUB_IOCPB0_MASK                       0x00000001
#define _CNPUB_IOCPB0_LENGTH                     0x00000001

#define _CNPUB_IOCPB1_POSITION                   0x00000001
#define _CNPUB_IOCPB1_MASK                       0x00000002
#define _CNPUB_IOCPB1_LENGTH                     0x00000001

#define _CNPUB_IOCPB2_POSITION                   0x00000002
#define _CNPUB_IOCPB2_MASK                       0x00000004
#define _CNPUB_IOCPB2_LENGTH                     0x00000001

#define _CNPUB_IOCPB3_POSITION                   0x00000003
#define _CNPUB_IOCPB3_MASK                       0x00000008
#define _CNPUB_IOCPB3_LENGTH                     0x00000001

#define _CNPUB_IOCPB4_POSITION                   0x00000004
#define _CNPUB_IOCPB4_MASK                       0x00000010
#define _CNPUB_IOCPB4_LENGTH                     0x00000001

#define _CNPUB_IOCPB5_POSITION                   0x00000005
#define _CNPUB_IOCPB5_MASK                       0x00000020
#define _CNPUB_IOCPB5_LENGTH                     0x00000001

#define _CNPUB_IOCPB6_POSITION                   0x00000006
#define _CNPUB_IOCPB6_MASK                       0x00000040
#define _CNPUB_IOCPB6_LENGTH                     0x00000001

#define _CNPUB_IOCPB7_POSITION                   0x00000007
#define _CNPUB_IOCPB7_MASK                       0x00000080
#define _CNPUB_IOCPB7_LENGTH                     0x00000001

#define _CNPUB_IOCPB8_POSITION                   0x00000008
#define _CNPUB_IOCPB8_MASK                       0x00000100
#define _CNPUB_IOCPB8_LENGTH                     0x00000001

#define _CNPUB_IOCPB9_POSITION                   0x00000009
#define _CNPUB_IOCPB9_MASK                       0x00000200
#define _CNPUB_IOCPB9_LENGTH                     0x00000001

#define _CNPUB_IOCPB10_POSITION                  0x0000000A
#define _CNPUB_IOCPB10_MASK                      0x00000400
#define _CNPUB_IOCPB10_LENGTH                    0x00000001

#define _CNPUB_IOCPB11_POSITION                  0x0000000B
#define _CNPUB_IOCPB11_MASK                      0x00000800
#define _CNPUB_IOCPB11_LENGTH                    0x00000001

#define _CNPUB_IOCPB12_POSITION                  0x0000000C
#define _CNPUB_IOCPB12_MASK                      0x00001000
#define _CNPUB_IOCPB12_LENGTH                    0x00000001

#define _CNPUB_IOCPB13_POSITION                  0x0000000D
#define _CNPUB_IOCPB13_MASK                      0x00002000
#define _CNPUB_IOCPB13_LENGTH                    0x00000001

#define _CNPUB_IOCPB14_POSITION                  0x0000000E
#define _CNPUB_IOCPB14_MASK                      0x00004000
#define _CNPUB_IOCPB14_LENGTH                    0x00000001

#define _CNPUB_IOCPB15_POSITION                  0x0000000F
#define _CNPUB_IOCPB15_MASK                      0x00008000
#define _CNPUB_IOCPB15_LENGTH                    0x00000001

#define _CNPUB_IOCPUB0_POSITION                  0x00000000
#define _CNPUB_IOCPUB0_MASK                      0x00000001
#define _CNPUB_IOCPUB0_LENGTH                    0x00000001

#define _CNPUB_IOCPUB1_POSITION                  0x00000001
#define _CNPUB_IOCPUB1_MASK                      0x00000002
#define _CNPUB_IOCPUB1_LENGTH                    0x00000001

#define _CNPUB_IOCPUB2_POSITION                  0x00000002
#define _CNPUB_IOCPUB2_MASK                      0x00000004
#define _CNPUB_IOCPUB2_LENGTH                    0x00000001

#define _CNPUB_IOCPUB3_POSITION                  0x00000003
#define _CNPUB_IOCPUB3_MASK                      0x00000008
#define _CNPUB_IOCPUB3_LENGTH                    0x00000001

#define _CNPUB_IOCPUB4_POSITION                  0x00000004
#define _CNPUB_IOCPUB4_MASK                      0x00000010
#define _CNPUB_IOCPUB4_LENGTH                    0x00000001

#define _CNPUB_IOCPUB5_POSITION                  0x00000005
#define _CNPUB_IOCPUB5_MASK                      0x00000020
#define _CNPUB_IOCPUB5_LENGTH                    0x00000001

#define _CNPUB_IOCPUB6_POSITION                  0x00000006
#define _CNPUB_IOCPUB6_MASK                      0x00000040
#define _CNPUB_IOCPUB6_LENGTH                    0x00000001

#define _CNPUB_IOCPUB7_POSITION                  0x00000007
#define _CNPUB_IOCPUB7_MASK                      0x00000080
#define _CNPUB_IOCPUB7_LENGTH                    0x00000001

