MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA704/mcu.h
#define _CNPUC_IOCPC1_POSITION                   0x00000001
#define _CNPUC_IOCPC1_MASK                       0x00000002
#define _CNPUC_IOCPC1_LENGTH                     0x00000001

#define _CNPUC_IOCPC2_POSITION                   0x00000002
#define _CNPUC_IOCPC2_MASK                       0x00000004
#define _CNPUC_IOCPC2_LENGTH                     0x00000001

#define _CNPUC_IOCPC3_POSITION                   0x00000003
#define _CNPUC_IOCPC3_MASK                       0x00000008
#define _CNPUC_IOCPC3_LENGTH                     0x00000001

#define _CNPUC_IOCPC4_POSITION                   0x00000004
#define _CNPUC_IOCPC4_MASK                       0x00000010
#define _CNPUC_IOCPC4_LENGTH                     0x00000001

#define _CNPUC_IOCPC5_POSITION                   0x00000005
#define _CNPUC_IOCPC5_MASK                       0x00000020
#define _CNPUC_IOCPC5_LENGTH                     0x00000001

#define _CNPUC_IOCPC6_POSITION                   0x00000006
#define _CNPUC_IOCPC6_MASK                       0x00000040
#define _CNPUC_IOCPC6_LENGTH                     0x00000001

#define _CNPUC_IOCPC7_POSITION                   0x00000007
#define _CNPUC_IOCPC7_MASK                       0x00000080
#define _CNPUC_IOCPC7_LENGTH                     0x00000001

#define _CNPUC_IOCPC8_POSITION                   0x00000008
#define _CNPUC_IOCPC8_MASK                       0x00000100
#define _CNPUC_IOCPC8_LENGTH                     0x00000001

#define _CNPUC_IOCPC9_POSITION                   0x00000009
#define _CNPUC_IOCPC9_MASK                       0x00000200
#define _CNPUC_IOCPC9_LENGTH                     0x00000001

#define _CNPUC_IOCPUC0_POSITION                  0x00000000
#define _CNPUC_IOCPUC0_MASK                      0x00000001
#define _CNPUC_IOCPUC0_LENGTH                    0x00000001

#define _CNPUC_IOCPUC1_POSITION                  0x00000001
#define _CNPUC_IOCPUC1_MASK                      0x00000002
#define _CNPUC_IOCPUC1_LENGTH                    0x00000001

#define _CNPUC_IOCPUC2_POSITION                  0x00000002
#define _CNPUC_IOCPUC2_MASK                      0x00000004
#define _CNPUC_IOCPUC2_LENGTH                    0x00000001

#define _CNPUC_IOCPUC3_POSITION                  0x00000003
#define _CNPUC_IOCPUC3_MASK                      0x00000008
#define _CNPUC_IOCPUC3_LENGTH                    0x00000001

#define _CNPUC_IOCPUC4_POSITION                  0x00000004
#define _CNPUC_IOCPUC4_MASK                      0x00000010
#define _CNPUC_IOCPUC4_LENGTH                    0x00000001

#define _CNPUC_IOCPUC5_POSITION                  0x00000005
#define _CNPUC_IOCPUC5_MASK                      0x00000020
#define _CNPUC_IOCPUC5_LENGTH                    0x00000001

#define _CNPUC_IOCPUC6_POSITION                  0x00000006
#define _CNPUC_IOCPUC6_MASK                      0x00000040
#define _CNPUC_IOCPUC6_LENGTH                    0x00000001

#define _CNPUC_IOCPUC7_POSITION                  0x00000007
#define _CNPUC_IOCPUC7_MASK                      0x00000080
#define _CNPUC_IOCPUC7_LENGTH                    0x00000001

#define _CNPUC_IOCPUC8_POSITION                  0x00000008
#define _CNPUC_IOCPUC8_MASK                      0x00000100
#define _CNPUC_IOCPUC8_LENGTH                    0x00000001

#define _CNPUC_IOCPUC9_POSITION                  0x00000009
#define _CNPUC_IOCPUC9_MASK                      0x00000200
#define _CNPUC_IOCPUC9_LENGTH                    0x00000001

#define _CNPUC_CNPUC0_POSITION                   0x00000000
#define _CNPUC_CNPUC0_MASK                       0x00000001
#define _CNPUC_CNPUC0_LENGTH                     0x00000001

#define _CNPUC_CNPUC1_POSITION                   0x00000001
#define _CNPUC_CNPUC1_MASK                       0x00000002
#define _CNPUC_CNPUC1_LENGTH                     0x00000001

#define _CNPUC_CNPUC2_POSITION                   0x00000002
#define _CNPUC_CNPUC2_MASK                       0x00000004
#define _CNPUC_CNPUC2_LENGTH                     0x00000001

#define _CNPUC_CNPUC3_POSITION                   0x00000003
#define _CNPUC_CNPUC3_MASK                       0x00000008
#define _CNPUC_CNPUC3_LENGTH                     0x00000001

#define _CNPUC_CNPUC4_POSITION                   0x00000004
#define _CNPUC_CNPUC4_MASK                       0x00000010
#define _CNPUC_CNPUC4_LENGTH                     0x00000001

#define _CNPUC_CNPUC5_POSITION                   0x00000005
#define _CNPUC_CNPUC5_MASK                       0x00000020
#define _CNPUC_CNPUC5_LENGTH                     0x00000001

#define _CNPUC_CNPUC6_POSITION                   0x00000006
#define _CNPUC_CNPUC6_MASK                       0x00000040
#define _CNPUC_CNPUC6_LENGTH                     0x00000001

#define _CNPUC_CNPUC7_POSITION                   0x00000007
#define _CNPUC_CNPUC7_MASK                       0x00000080
#define _CNPUC_CNPUC7_LENGTH                     0x00000001

#define _CNPUC_CNPUC8_POSITION                   0x00000008
#define _CNPUC_CNPUC8_MASK                       0x00000100
#define _CNPUC_CNPUC8_LENGTH                     0x00000001

#define _CNPUC_CNPUC9_POSITION                   0x00000009
#define _CNPUC_CNPUC9_MASK                       0x00000200
#define _CNPUC_CNPUC9_LENGTH                     0x00000001

#define _IOCPUC_IOCPC0_POSITION                  0x00000000
#define _IOCPUC_IOCPC0_MASK                      0x00000001
#define _IOCPUC_IOCPC0_LENGTH                    0x00000001

#define _IOCPUC_IOCPC1_POSITION                  0x00000001
#define _IOCPUC_IOCPC1_MASK                      0x00000002
#define _IOCPUC_IOCPC1_LENGTH                    0x00000001

#define _IOCPUC_IOCPC2_POSITION                  0x00000002
#define _IOCPUC_IOCPC2_MASK                      0x00000004
#define _IOCPUC_IOCPC2_LENGTH                    0x00000001

#define _IOCPUC_IOCPC3_POSITION                  0x00000003
#define _IOCPUC_IOCPC3_MASK                      0x00000008
#define _IOCPUC_IOCPC3_LENGTH                    0x00000001

#define _IOCPUC_IOCPC4_POSITION                  0x00000004
#define _IOCPUC_IOCPC4_MASK                      0x00000010
#define _IOCPUC_IOCPC4_LENGTH                    0x00000001

#define _IOCPUC_IOCPC5_POSITION                  0x00000005
#define _IOCPUC_IOCPC5_MASK                      0x00000020
#define _IOCPUC_IOCPC5_LENGTH                    0x00000001

#define _IOCPUC_IOCPC6_POSITION                  0x00000006
#define _IOCPUC_IOCPC6_MASK                      0x00000040
#define _IOCPUC_IOCPC6_LENGTH                    0x00000001

#define _IOCPUC_IOCPC7_POSITION                  0x00000007
#define _IOCPUC_IOCPC7_MASK                      0x00000080
#define _IOCPUC_IOCPC7_LENGTH                    0x00000001

#define _IOCPUC_IOCPC8_POSITION                  0x00000008
#define _IOCPUC_IOCPC8_MASK                      0x00000100
#define _IOCPUC_IOCPC8_LENGTH                    0x00000001

#define _IOCPUC_IOCPC9_POSITION                  0x00000009
#define _IOCPUC_IOCPC9_MASK                      0x00000200
#define _IOCPUC_IOCPC9_LENGTH                    0x00000001

#define _IOCPUC_IOCPUC0_POSITION                 0x00000000
#define _IOCPUC_IOCPUC0_MASK                     0x00000001
#define _IOCPUC_IOCPUC0_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC1_POSITION                 0x00000001
#define _IOCPUC_IOCPUC1_MASK                     0x00000002
#define _IOCPUC_IOCPUC1_LENGTH                   0x00000001

