MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA704/mcu.h
#define _IOCPUC_IOCPUC2_POSITION                 0x00000002
#define _IOCPUC_IOCPUC2_MASK                     0x00000004
#define _IOCPUC_IOCPUC2_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC3_POSITION                 0x00000003
#define _IOCPUC_IOCPUC3_MASK                     0x00000008
#define _IOCPUC_IOCPUC3_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC4_POSITION                 0x00000004
#define _IOCPUC_IOCPUC4_MASK                     0x00000010
#define _IOCPUC_IOCPUC4_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC5_POSITION                 0x00000005
#define _IOCPUC_IOCPUC5_MASK                     0x00000020
#define _IOCPUC_IOCPUC5_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC6_POSITION                 0x00000006
#define _IOCPUC_IOCPUC6_MASK                     0x00000040
#define _IOCPUC_IOCPUC6_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC7_POSITION                 0x00000007
#define _IOCPUC_IOCPUC7_MASK                     0x00000080
#define _IOCPUC_IOCPUC7_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC8_POSITION                 0x00000008
#define _IOCPUC_IOCPUC8_MASK                     0x00000100
#define _IOCPUC_IOCPUC8_LENGTH                   0x00000001

#define _IOCPUC_IOCPUC9_POSITION                 0x00000009
#define _IOCPUC_IOCPUC9_MASK                     0x00000200
#define _IOCPUC_IOCPUC9_LENGTH                   0x00000001

#define _IOCPUC_CNPUC0_POSITION                  0x00000000
#define _IOCPUC_CNPUC0_MASK                      0x00000001
#define _IOCPUC_CNPUC0_LENGTH                    0x00000001

#define _IOCPUC_CNPUC1_POSITION                  0x00000001
#define _IOCPUC_CNPUC1_MASK                      0x00000002
#define _IOCPUC_CNPUC1_LENGTH                    0x00000001

#define _IOCPUC_CNPUC2_POSITION                  0x00000002
#define _IOCPUC_CNPUC2_MASK                      0x00000004
#define _IOCPUC_CNPUC2_LENGTH                    0x00000001

#define _IOCPUC_CNPUC3_POSITION                  0x00000003
#define _IOCPUC_CNPUC3_MASK                      0x00000008
#define _IOCPUC_CNPUC3_LENGTH                    0x00000001

#define _IOCPUC_CNPUC4_POSITION                  0x00000004
#define _IOCPUC_CNPUC4_MASK                      0x00000010
#define _IOCPUC_CNPUC4_LENGTH                    0x00000001

#define _IOCPUC_CNPUC5_POSITION                  0x00000005
#define _IOCPUC_CNPUC5_MASK                      0x00000020
#define _IOCPUC_CNPUC5_LENGTH                    0x00000001

#define _IOCPUC_CNPUC6_POSITION                  0x00000006
#define _IOCPUC_CNPUC6_MASK                      0x00000040
#define _IOCPUC_CNPUC6_LENGTH                    0x00000001

#define _IOCPUC_CNPUC7_POSITION                  0x00000007
#define _IOCPUC_CNPUC7_MASK                      0x00000080
#define _IOCPUC_CNPUC7_LENGTH                    0x00000001

#define _IOCPUC_CNPUC8_POSITION                  0x00000008
#define _IOCPUC_CNPUC8_MASK                      0x00000100
#define _IOCPUC_CNPUC8_LENGTH                    0x00000001

#define _IOCPUC_CNPUC9_POSITION                  0x00000009
#define _IOCPUC_CNPUC9_MASK                      0x00000200
#define _IOCPUC_CNPUC9_LENGTH                    0x00000001

#define _CNPDC_IOCPDC0_POSITION                  0x00000000
#define _CNPDC_IOCPDC0_MASK                      0x00000001
#define _CNPDC_IOCPDC0_LENGTH                    0x00000001

#define _CNPDC_IOCPDC1_POSITION                  0x00000001
#define _CNPDC_IOCPDC1_MASK                      0x00000002
#define _CNPDC_IOCPDC1_LENGTH                    0x00000001

#define _CNPDC_IOCPDC2_POSITION                  0x00000002
#define _CNPDC_IOCPDC2_MASK                      0x00000004
#define _CNPDC_IOCPDC2_LENGTH                    0x00000001

#define _CNPDC_IOCPDC3_POSITION                  0x00000003
#define _CNPDC_IOCPDC3_MASK                      0x00000008
#define _CNPDC_IOCPDC3_LENGTH                    0x00000001

#define _CNPDC_IOCPDC4_POSITION                  0x00000004
#define _CNPDC_IOCPDC4_MASK                      0x00000010
#define _CNPDC_IOCPDC4_LENGTH                    0x00000001

#define _CNPDC_IOCPDC5_POSITION                  0x00000005
#define _CNPDC_IOCPDC5_MASK                      0x00000020
#define _CNPDC_IOCPDC5_LENGTH                    0x00000001

#define _CNPDC_IOCPDC6_POSITION                  0x00000006
#define _CNPDC_IOCPDC6_MASK                      0x00000040
#define _CNPDC_IOCPDC6_LENGTH                    0x00000001

#define _CNPDC_IOCPDC7_POSITION                  0x00000007
#define _CNPDC_IOCPDC7_MASK                      0x00000080
#define _CNPDC_IOCPDC7_LENGTH                    0x00000001

#define _CNPDC_IOCPDC8_POSITION                  0x00000008
#define _CNPDC_IOCPDC8_MASK                      0x00000100
#define _CNPDC_IOCPDC8_LENGTH                    0x00000001

#define _CNPDC_IOCPDC9_POSITION                  0x00000009
#define _CNPDC_IOCPDC9_MASK                      0x00000200
#define _CNPDC_IOCPDC9_LENGTH                    0x00000001

#define _CNPDC_CNPDC0_POSITION                   0x00000000
#define _CNPDC_CNPDC0_MASK                       0x00000001
#define _CNPDC_CNPDC0_LENGTH                     0x00000001

#define _CNPDC_CNPDC1_POSITION                   0x00000001
#define _CNPDC_CNPDC1_MASK                       0x00000002
#define _CNPDC_CNPDC1_LENGTH                     0x00000001

#define _CNPDC_CNPDC2_POSITION                   0x00000002
#define _CNPDC_CNPDC2_MASK                       0x00000004
#define _CNPDC_CNPDC2_LENGTH                     0x00000001

#define _CNPDC_CNPDC3_POSITION                   0x00000003
#define _CNPDC_CNPDC3_MASK                       0x00000008
#define _CNPDC_CNPDC3_LENGTH                     0x00000001

#define _CNPDC_CNPDC4_POSITION                   0x00000004
#define _CNPDC_CNPDC4_MASK                       0x00000010
#define _CNPDC_CNPDC4_LENGTH                     0x00000001

#define _CNPDC_CNPDC5_POSITION                   0x00000005
#define _CNPDC_CNPDC5_MASK                       0x00000020
#define _CNPDC_CNPDC5_LENGTH                     0x00000001

